# Создайте список [ 18, 14, 10, 6, 2 ] с помощью функции range()
#  и выведите его на экран.
for x in range(18, -2, -4):
    print(x, end=' ')
